In [18]:
import pandas as pd
import numpy as np

In [19]:
employee = { 
    "Name": ["Anil", "Sunil", "Mahesh", "John", "Peter"],
    "Age" : [24, 23, np.nan, 32, 35],
    "Salary": [10000, 15000, 20000, 25000, 30000]

}

To create DataFrame
DataFrame_Name = pd.DataFrame(dictionary)

In [20]:
employee_df = pd.DataFrame(employee)

In [21]:
employee_df

     Name   Age  Salary
0    Anil  24.0   10000
1   Sunil  23.0   15000
2  Mahesh   NaN   20000
3    John  32.0   25000
4   Peter  35.0   30000

In [22]:
type(employee_df)

pandas.core.frame.DataFrame

In [23]:
type(employee_df['Name'])

pandas.core.series.Series

In [24]:
#employee_df['Name']
employee_df['Age']

0    24.0
1    23.0
2     NaN
3    32.0
4    35.0
Name: Age, dtype: float64

In [25]:
# if you want to put more than 1 column , then put 2 square brackets to pass list 
employee_df[['Name', 'Age']]

     Name   Age
0    Anil  24.0
1   Sunil  23.0
2  Mahesh   NaN
3    John  32.0
4   Peter  35.0

In [26]:
employee_df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [27]:
employee_df.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
employee_df.Salary.sum()

np.int64(100000)

In [29]:
employee_df.Age.mean()  #Average

np.float64(28.5)

In [30]:
employee_df.Salary.max()   #maximum Salary

np.int64(30000)

In [31]:
employee_df.Age.min()

np.float64(23.0)

In [32]:
employee_df.Salary.count() #  count of the number of salary

np.int64(5)

In [33]:
employee_df.Age.count() # number count of age

np.int64(4)